Documents/Лео_УстановкаПланаПремииНепрямымКлиентам/Лео_УстановкаПланаПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаПланаПремииНепрямымКлиентам</name>
  <registerRecords>AccumulationRegister.Лео_ПланФактПримииНепрямымКлиентам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товарооборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_ПареметрыРасчетаПремииКлиентам/Лео_ПареметрыРасчетаПремииКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПареметрыРасчетаПремииКлиентам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойТоварооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварооборотСУчетомНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>EnumRef.Лео_ТипОтчетаНепрямыхКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_УстановкаПланаПремииНепрямымКлиентам/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоПараметрамРасчетаПремии(Команда)
	
	ТзНастройкиПремрования = ЗапросПолучитьНастройкиПремии(Объект.Дата);
	Если ТзНастройкиПремрования.Количество() > 0 Тогда
		ЗаполнитьТЧ (ТзНастройкиПремрования)
		//Для каждого СтрокаТзНастройкиПремрования  Из ТзНастройкиПремрования Цикл
		//КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗапросПолучитьНастройкиПремии (ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.НачалоПериода,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент КАК Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть КАК Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность КАК Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот КАК Товарооборот
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(&ДатаСреза, Действует = ИСТИНА) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
		|			ВложенныйЗапрос.Периодичность КАК Периодичность
		|		ИЗ
		|			(ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК НачалоПериода,
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц) КАК Периодичность
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, КВАРТАЛ),
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, ПОЛУГОДИЕ),
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.НачалоПериода,
		|			ВложенныйЗапрос.Периодичность) КАК Периоды
		|		ПО Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность = Периоды.Периодичность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Сеть,
		|	Периодичность";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);

	Результат = Запрос.Выполнить();

	ТзНастройкиПремрования = Результат.Выгрузить();

	Возврат ТзНастройкиПремрования
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧ (Таблицазагрузки)
	ТчПлан = Объект.План;
	ТчПлан.Загрузить(Таблицазагрузки);	
КонецПроцедуры

&НаКлиенте
Процедура ПланТоварооборотПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтроки(ТекСтрока)
	
	Если  ТекСтрока.Товарооборот > 0 Тогда
		Если ТекСтрока.ПроцентПремии  > 0 Тогда
			ТекСтрока.Премия =  ТекСтрока.Товарооборот / 100 *  ТекСтрока.ПроцентПремии +  ТекСтрока.ФиксированнаяСумма;
		Иначе
			ТекСтрока.Премия = ТекСтрока.ФиксированнаяСумма;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПроцентПремииПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ПланФиксированнаяСуммаПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);

КонецПроцедуры
